# CurveRoofSkippedLoops Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RoofFailures..::..CurveRoofSkippedLoops Property
BuiltInFailures..::..RoofFailures Class See Also
---
Some loops were skipped
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CurveRoofSkippedLoops { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CurveRoofSkippedLoops As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CurveRoofSkippedLoops {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RoofFailures Class
Autodesk.Revit.DB Namespace